system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
  (-0.604 -2.784 -0.201384)
  (0.604 -2.784 -0.201384)
  (0.604 2.324 -0.201384)
  (-0.604 2.324 -0.201384)
  (-0.604 -2.784 2.284)
  (0.604 -2.784 2.284)
  (0.604 2.324 2.284)
  (-0.604 2.324 2.284)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (14 42 19) simpleGrading (1 1 1)
);
edges ();
patches ();
mergePatchPairs ();


// ************************************************************************* //
